{
    "functions": [
      "Could you write a function that returns the first ten primes?",
      "Could you write a function that takes two numbers and returns their sum?",
      "Could you write a function that sorts a list of integers in ascending order?",
      "Could you write a function that checks if a string is a palindrome?",
      "Could you write a function that calculates the area of a circle?",
      "Could you write a function that returns the Fibonacci sequence up to a given number?",
      "Could you write a function that converts a temperature from Celsius to Fahrenheit?",
      "Could you write a function that calculates the factorial of a number?",
      "Could you write a function that generates a random number between two given integers?",
      "Could you write a function that counts the number of vowels in a string?",
      "Could you write a function that finds the largest element in a list?",
      "Could you write a function that checks if a number is prime?",
      "Could you write a function that generates a list of even numbers up to a given limit?",
      "Could you write a function that takes a list of numbers and returns the product of all the elements?",
      "Could you write a function that removes duplicates from a list?",
      "Could you write a function that returns the reverse of a string?",
      "Could you write a function that checks if two strings are anagrams?",
      "Could you write a function that checks if a number is a palindrome?",
      "Could you write a function that calculates the square root of a number?",
      "Could you write a function that calculates the mean of a list of numbers?",
      "Could you write a function that generates a list of prime numbers up to a given limit?",
      "Could you write a function that takes a list of strings and returns the longest string?",
      "Could you write a function that takes a list of integers and returns the sum of the even numbers?",
      "Could you write a function that checks if a given year is a leap year?",
      "Could you write a function that checks if a string is a valid email address?",
      "Could you write a function that calculates the molar mass of a chemical compound?",
      "Could you write a function that determines the number of hydrogen atoms in a chemical compound?",
      "Could you write a function that converts a chemical formula to a Lewis structure?",
      "Could you write a function that calculates the boiling point of a chemical compound?",
      "Could you write a function that determines the melting point of a chemical compound?",
      "Could you write a function that finds the number of carbon atoms in a chemical compound?",
      "Could you write a function that calculates the pH of a solution?",
      "Could you write a function that determines the molecular geometry of a compound?",
      "Could you write a function that converts a chemical formula to a skeletal structure?",
      "Could you write a function that predicts the polarity of a molecule?",
      "Could you write a function that determines the functional groups present in a compound?",
      "Could you write a function that calculates the bond angles in a molecule?",
      "Could you write a function that predicts the reactivity of a chemical compound?",
      "Could you write a function that determines the steric hindrance in a molecule?",
      "Could you write a function that predicts the solubility of a compound?",
      "Could you write a function that determines the acidity of a molecule?",
      "Could you write a function that calculates the bond length in a molecule?",
      "Could you write a function that predicts the stability of a compound?",
      "Could you write a function that determines the basicity of a molecule?",
      "Could you write a function that calculates the dipole moment of a molecule?",
      "Could you write a function that predicts the chirality of a compound?",
      "Could you write a function that determines the conformational isomers of a molecule?",
      "Could you write a function that calculates the heat of formation of a compound?",
      "Could you write a function that predicts the optical activity of a compound?",
      "Could you write a function that determines the reductive potential of a molecule?",
      "Could you write a function that calculates the BMI (Body Mass Index) for a given height and weight?",
      "Could you write a function that computes the body surface area (BSA) of a patient given their height and weight?",
      "Could you write a function that calculates the optimal dosage of medication based on the patient's age, weight, and medical condition?",
      "Could you write a function that converts blood pressure measurements from mmHg to kPa and vice versa?",
      "Could you write a function that determines the risk of cardiovascular disease based on a patient's cholesterol levels?",
      "Could you write a function that estimates the glomerular filtration rate (GFR) of a patient's kidneys based on their creatinine levels?",
      "Could you write a function that predicts the probability of a patient developing diabetes based on their family history and lifestyle?",
      "Could you write a function that calculates the amount of insulin a diabetic patient needs based on their blood sugar levels and carbohydrate intake?",
      "Could you write a function that assesses the risk of osteoporosis in a patient based on their bone density and age?",
      "Could you write a function that evaluates a patient's risk of developing cancer based on their genetic predisposition and lifestyle choices?",
      "Could you write a function that determines the optimal dose of a medication based on a patient's liver function tests?",
      "Could you write a function that calculates the risk of stroke based on a patient's blood pressure, cholesterol levels, and lifestyle factors?",
      "Could you write a function that estimates the expected recovery time for a patient after a certain surgical procedure based on their age, overall health, and the complexity of the surgery?",
      "Could you write a function that calculates the expected blood loss during a surgical procedure based on the type of surgery and the patient's medical history?",
      "Could you write a function that predicts the likelihood of a patient having a successful outcome after a certain surgical procedure based on their overall health and the surgeon's experience?",
      "Could you write a function that determines the optimal dosage of anesthesia for a patient based on their weight, age, and medical condition?",
      "Could you write a function that assesses a patient's risk of developing a postoperative infection based on their medical history and the type of surgery?",
      "Could you write a function that predicts a patient's risk of developing sepsis based on their vital signs and the presence of certain risk factors?",
      "Could you write a function that evaluates a patient's risk of developing septic shock based on their initial symptoms and laboratory test results?",
      "Could you write a function that estimates a patient's risk of developing a complication after surgery based on their age, medical history, and the type of surgery?",
      "Could you write a function that calculates a patient's estimated blood volume based on their weight and height?",
      "Could you write a function that predicts the likelihood of a patient experiencing a certain side effect from a medication based on their age, sex, and medical history?",
      "Could you write a function that estimates the risk of a patient developing a pulmonary embolism based on their medical history, recent surgeries, and other risk factors?",
      "Could you write a function that calculates the risk of a patient developing a deep vein thrombosis (DVT) based on their medical history, recent surgeries, and other risk factors?",
      "Could you write a function that determines the likelihood of a patient developing a postoperative complication based on their overall health, age, and the type of surgery?",
      "Could you write a function that assesses a patient's risk of developing a surgical site infection based on their medical history, the type of surgery, and other risk factors?",
      "Could you write a function that calculates the Schwarzschild radius given the mass of an object?",
      "Could you write a function that calculates the luminosity of a star based on its temperature and radius?",
      "Could you write a function that calculates the velocity required to achieve a stable orbit around a planet?",
      "Could you write a function that determines the escape velocity of an object given its mass and radius?",
      "Could you write a function that computes the period of a planet's orbit around its star?",
      "Could you write a function that estimates the distance between two stars in a binary system based on their orbital parameters?",
      "Could you write a function that simulates the motion of a comet through the Solar System?",
      "Could you write a function that predicts the magnitude of a supernova based on its type and distance from Earth?",
      "Could you write a function that determines the amount of energy released in a gamma-ray burst?",
      "Could you write a function that calculates the angular separation between two celestial objects?",
      "Could you write a function that predicts the mass of a black hole based on its luminosity?",
      "Could you write a function that simulates the expansion of the universe?",
      "Could you write a function that estimates the age of a star based on its mass and luminosity?",
      "Could you write a function that calculates the mass of a planet given its orbital period and distance from its star?",
      "Could you write a function that determines the temperature of a star given its spectral type?",
      "Could you write a function that simulates the formation of a solar system?",
      "Could you write a function that calculates the size of a galaxy based on its luminosity?",
      "Could you write a function that predicts the lifetime of a star based on its mass?",
      "Could you write a function that calculates the redshift of a galaxy based on its distance from Earth?",
      "Could you write a function that simulates the interaction between two galaxies in a merger?",
      "Could you write a function that determines the probability of a gamma-ray burst occurring in a given region of space?",
      "Could you write a function that calculates the density of dark matter in a galaxy cluster?",
      "Could you write a function that predicts the likelihood of a star hosting exoplanets based on its metallicity?",
      "Could you write a function that simulates the formation and evolution of a star cluster?",
      "Could you write a function that calculates the rotational period of a planet?",
      "Could you write a function that calculates the hypotenuse of a right triangle given the lengths of the other two sides?",
      "Could you write a function that calculates the lift force acting on a wing given the wing area, air density, and the square of the velocity of the air?",
      "Could you write a function that converts between Fahrenheit and Celsius temperatures?",
      "Could you write a function that computes the specific impulse of a rocket engine given the thrust and the rate of fuel consumption?",
      "Could you write a function that calculates the moment of inertia for a solid cylinder given its mass and radius?",
      "Could you write a function that finds the root of a quadratic equation given its coefficients?",
      "Could you write a function that calculates the induced drag of a wing given its lift coefficient and air density?",
      "Could you write a function that computes the weight of an object given its mass and the acceleration due to gravity?",
      "Could you write a function that calculates the Mach number of a flow given the speed of sound and the velocity of the flow?",
      "Could you write a function that computes the Reynolds number for a fluid flow given the density, viscosity, and characteristic length?",
      "Could you write a function that determines the range of a projectile launched at an angle given its initial velocity and the acceleration due to gravity?",
      "Could you write a function that calculates the drag force on a parachute given the air density, parachute area, and the square of the velocity?",
      "Could you write a function that determines the thrust required for an aircraft to maintain level flight given its weight, lift coefficient, and air density?",
      "Could you write a function that calculates the moment of inertia for a solid sphere given its mass and radius?",
      "Could you write a function that computes the total energy of an object in orbit given its mass, altitude, and the acceleration due to gravity?",
      "Could you write a function that determines the angle of attack required for an aircraft to maintain level flight given its lift coefficient and air density?",
      "Could you write a function that calculates the heat transfer rate in a heat exchanger given the mass flow rate, specific heat, and temperature difference?",
      "Could you write a function that computes the period of a pendulum given its length and the acceleration due to gravity?",
      "Could you write a function that determines the climb rate of an aircraft given its thrust, weight, and the rate of climb?",
      "Could you write a function that calculates the pressure drop in a pipe given the flow rate, pipe diameter, and fluid properties?",
      "Could you write a function that computes the gravitational potential energy of an object given its mass and altitude?",
      "Could you write a function that determines the efficiency of a propeller given the thrust, power, and velocity?",
      "Could you write a function that calculates the specific fuel consumption of an engine given the fuel flow rate and the thrust?",
      "Could you write a function that computes the critical Mach number for a flow given the speed of sound and the temperature?",
      "Could you write a function that determines the power required for an aircraft to maintain level flight given its weight, drag coefficient, and velocity?",
      "Could you write a function that calculates the frequency of a note given its name and octave?",
      "Could you write a function that converts a note's frequency to its corresponding MIDI note number?",
      "Could you write a function that determines the interval between two notes given their names and octaves?",
      "Could you write a function that calculates the frequency of a note given its MIDI note number?",
      "Could you write a function that determines the nearest note name and octave given a frequency?",
      "Could you write a function that converts a note's MIDI note number to its corresponding frequency?",
      "Could you write a function that determines the difference in cents between two frequencies?",
      "Could you write a function that calculates the frequency of a note given its interval from a reference note?",
      "Could you write a function that determines the frequency of a note given its frequency ratio with a reference note?",
      "Could you write a function that converts a frequency ratio to its corresponding interval name?",
      "Could you write a function that determines the note names and octaves in a given chord?",
      "Could you write a function that determines the frequency of a note given its note name and interval from a reference frequency?",
      "Could you write a function that calculates the note name, octave, and interval from a reference frequency given a frequency?",
      "Could you write a function that determines the note names and intervals in a given scale?",
      "Could you write a function that determines the note names and octaves in a given melody?",
      "Could you write a function that calculates the note name, octave, and interval from a reference frequency given a frequency ratio?",
      "Could you write a function that calculates the frequency of a note given its note name and interval from a reference note?",
      "Could you write a function that converts a frequency to its corresponding note name, octave, and interval from a reference frequency?",
      "Could you write a function that determines the note name and octave in a given melody?",
      "Could you write a function that calculates the note name, octave, and interval from a reference frequency given a frequency ratio and a reference note?",
      "Could you write a function that calculates the frequency ratio between two frequencies?",
      "Could you write a function that determines the frequency of a note given its note name and octave?",
      "Could you write a function that calculates the frequency ratio between two note names and octaves?",
      "Could you write a function that determines the note names and octaves in a given melody that respects a given scale?",
      "Could you write a function that calculates the note name, octave, and interval from a reference frequency given a frequency and a reference note?",
      "Could you write a function that calculates the area of a rectangle?",
      "Could you write a function that calculates the volume of a cylinder?",
      "Could you write a function that converts temperature from Celsius to Fahrenheit?",
      "Could you write a function that calculates the distance between two points in 3D space?",
      "Could you write a function that calculates the velocity of an object based on its acceleration and time?",
      "Could you write a function that calculates the average speed of a moving object?",
      "Could you write a function that calculates the torque of a rotating object?",
      "Could you write a function that calculates the kinetic energy of an object?",
      "Could you write a function that calculates the potential energy of an object?",
      "Could you write a function that calculates the work done by a force?",
      "Could you write a function that calculates the power of a machine?",
      "Could you write a function that calculates the force exerted by a spring?",
      "Could you write a function that calculates the force required to lift an object?",
      "Could you write a function that calculates the power required to lift an object?",
      "Could you write a function that calculates the stress on a material?",
      "Could you write a function that calculates the strain on a material?",
      "Could you write a function that calculates the frequency of a wave?",
      "Could you write a function that calculates the period of a wave?",
      "Could you write a function that calculates the speed of a wave?",
      "Could you write a function that calculates the wavelength of a wave?",
      "Could you write a function that calculates the amplitude of a wave?",
      "Could you write a function that calculates the damping ratio of a system?",
      "Could you write a function that calculates the natural frequency of a system?",
      "Could you write a function that calculates the resonant frequency of a system?",
      "Could you write a function that calculates the effective mass of a system?",
      "Could you write a function that returns the first ten primes?",
      "Could you write a function that checks if a number is prime?",
      "Could you write a function that finds the prime factorization of a number?",
      "Could you write a function that computes the least common multiple (LCM) of two numbers?",
      "Could you write a function that computes the greatest common divisor (GCD) of two numbers?",
      "Could you write a function that calculates the Euler's totient function of a number?",
      "Could you write a function that determines if two numbers are coprime?",
      "Could you write a function that returns the number of divisors of a given number?",
      "Could you write a function that calculates the sum of divisors of a number?",
      "Could you write a function that checks if a number is a perfect number?",
      "Could you write a function that finds the largest prime factor of a number?",
      "Could you write a function that determines if a number is a Fermat prime?",
      "Could you write a function that returns the n-th Fibonacci number?",
      "Could you write a function that determines if a number is a perfect square?",
      "Could you write a function that calculates the nth triangular number?",
      "Could you write a function that checks if a number is a triangular number?",
      "Could you write a function that finds the nth power of a given number?",
      "Could you write a function that calculates the nth root of a given number?",
      "Could you write a function that calculates the factorial of a given number?",
      "Could you write a function that computes the sum of squares of the first n natural numbers?",
      "Could you write a function that checks if a number is a palindrome?",
      "Could you write a function that finds the smallest palindrome larger than a given number?",
      "Could you write a function that checks if a number is a perfect number?",
      "Could you write a function that checks if a number is a deficient number?",
      "Could you write a function that checks if a number is an abundant number?"
    ]
  }